Jiangchunjun/Project_NFC_1_10V/Application/src/modules/Dali/HW/DaliUart_XMC1xxx.h
//******************************************************************************
#if (DEVICE_PERIPHCLK_MHz != DEVICE_SYSCLK_MHz)
  #undef DALI_CONFIG_TIMER_CLK_MHz
  #define DALI_CONFIG_TIMER_CLK_MHz       DEVICE_SYSCLK_MHz
  #define configDOUBLE_PRHP_CLK //MAX: damit PCLK = 2*MCLK
#endif

//----   D A L I    Interrupt Requests   ---------------------------------------
//
//----   config interrupt node   -----------------------------------------------
#if (DALI_CONFIG_CPTR_SRQ == 0)
  #define DALI_CPTR_IRQ                       CCU40_0_IRQn                        //common timer interrupt pointer 1
  #define DaliUart_RxCaptureISR                 CCU40_0_IRQHandler                  //address interrupt pointer 1 points on
  #define DALI_CPTR_IRQ_MSK            0x00200000UL            //IRQ21
#elif (DALI_CONFIG_CPTR_SRQ == 1)
  #define DALI_CPTR_IRQ                         CCU40_1_IRQn                        //common timer interrupt pointer 2
  #define DaliUart_RxCaptureISR                 CCU40_1_IRQHandler                  //address interrupt pointer 2 points on
  #define DALI_CPTR_IRQ_MSK            0x00400000UL            //IRQ22
#elif (DALI_CONFIG_CPTR_SRQ == 2)
  #define DALI_CPTR_IRQ                         CCU40_2_IRQn                        //common timer interrupt pointer 3
  #define DaliUart_RxCaptureISR                 CCU40_2_IRQHandler                  //address interrupt pointer 3 points on
  #define DALI_CPTR_IRQ_MSK            0x00800000UL            //IRQ23
#elif (DALI_CONFIG_CPTR_SRQ == 3)
  #define DALI_CPTR_IRQ                         CCU40_3_IRQn                        //common timer interrupt pointer 4
  #define DaliUart_RxCaptureISR                 CCU40_3_IRQHandler                  //address interrupt pointer 4 points on
  #define DALI_CPTR_IRQ_MSK            0x01000000UL            //IRQ24
#endif

#if (DALI_CONFIG_COMP_SRQ != DALI_CONFIG_CPTR_SRQ)
  #if (DALI_CONFIG_COMP_SRQ == 0)
    #define DALI_CMPR_IRQ                       CCU40_0_IRQn                        //common timer interrupt pointer 1
    #define DaliUart_TxCompareISR               CCU40_0_IRQHandler                  //address interrupt pointer 1 points on
    #define DALI_CMPR_IRQ_MSK          0x00200000UL            //IRQ21
  #elif (DALI_CONFIG_COMP_SRQ == 1)
    #define DALI_CMPR_IRQ                       CCU40_1_IRQn                        //common timer interrupt pointer 2
    #define DaliUart_TxCompareISR               CCU40_1_IRQHandler                  //address interrupt pointer 2 points on
    #define DALI_CMPR_IRQ_MSK          0x00400000UL            //IRQ22
  #elif (DALI_CONFIG_COMP_SRQ == 2)
    #define DALI_CMPR_IRQ                       CCU40_2_IRQn                        //common timer interrupt pointer 3
    #define DaliUart_TxCompareISR               CCU40_2_IRQHandler                  //address interrupt pointer 3 points on
    #define DALI_CMPR_IRQ_MSK          0x00800000UL            //IRQ23
  #elif (DALI_CONFIG_COMP_SRQ == 3)
    #define DALI_CMPR_IRQ                       CCU40_3_IRQn                        //common timer interrupt pointer 4
    #define DaliUart_TxCompareISR               CCU40_3_IRQHandler                  //address interrupt pointer 4 points on
    #define DALI_CMPR_IRQ_MSK          0x01000000UL            //IRQ24
  #endif
#else
  capture and compare timer have to use different interrupt requests (unit: %)
#endif

#define CLR_DALI_INTRPT_PENDING            PPB->NVIC_ICPR = (DALI_CMPR_IRQ_MSK | DALI_CPTR_IRQ_MSK)
#define ENABLE_DALI_INTRPT_NODE           PPB->NVIC_ISER = (DALI_CMPR_IRQ_MSK | DALI_CPTR_IRQ_MSK)
#define DISABLE_DALI_INTRPT_NODE          PPB->NVIC_ICER = (DALI_CMPR_IRQ_MSK | DALI_CPTR_IRQ_MSK)

#define FORCE_DALI_RxCAPTURE_IRQ                PPB->NVIC_ISPR = DALI_CPTR_IRQ_MSK     //force ISR
#define CLEAR_DALI_RxCAPTURE_FLAG               PPB->NVIC_ICPR = DALI_CPTR_IRQ_MSK    //clear interrupt pending flag
#define DALI_RxCAPTURE_IRQ_PENDING              ((PPB->NVIC_ISPR &= DALI_CPTR_IRQ_MSK) != 0)  //check if capture interrupt is pending

#define FORCE_DALI_TxCOMPARE_IRQ                PPB->NVIC_ISPR = DALI_CMPR_IRQ_MSK     //force ISR
#define CLEAR_DALI_TxCOMPARE_FLAG               PPB->NVIC_ICPR = DALI_CMPR_IRQ_MSK     //clear interrupt pending flag
#define DALI_TxCOMPARE_IRQ_PENDING              ((PPB->NVIC_ISPR &= DALI_CMPR_IRQ_MSK) != 0)  //check if compare interrupt is pending


//----   config service request   ----------------------------------------------
#define ENABLE_DALI_RxCAPTURE_IRQ               DALI_TIM_Rx->INTE = CCU4_CC4_INTE_E0AE_Msk         //disables all other cc service requests
#define DISABLE_DALI_RxCAPTURE_IRQ              DALI_TIM_Rx->INTE &= (~CCU4_CC4_INTE_E0AE_Msk)
#define DALI_RxCAPTURE_SRQ_ENABLED              ((DALI_TIM_Rx->INTE & CCU4_CC4_INTE_E0AE_Msk)!=0)   //ask for service request enabled
#if (DALI_CONFIG_CPTR_SRQ == 0)
  #define SET_DALI_Rx_SERVICE          DALI_TIM_Rx->SRS = 0x0000UL              //select CC40SR0 for event0 (capture), CC40SR1 for period match (compare)
#elif (DALI_CONFIG_CPTR_SRQ == 1)
  #define SET_DALI_Rx_SERVICE          DALI_TIM_Rx->SRS = 0x0100UL              //select CC40SR1 for event0 (capture), CC40SR1 for period match (compare)
#elif (DALI_CONFIG_CPTR_SRQ == 2)
  #define SET_DALI_Rx_SERVICE          DALI_TIM_Rx->SRS = 0x0200UL              //select CC40SR2 for event0 (capture), CC40SR1 for period match (compare)
#elif (DALI_CONFIG_CPTR_SRQ == 3)
  #define SET_DALI_Rx_SERVICE          DALI_TIM_Rx->SRS = 0x0300UL              //select CC40SR3 for event0 (capture), CC40SR1 for period match (compare)
#endif

#define ENABLE_DALI_TxCOMPARE_IRQ              DALI_TIM_Tx->INTE = CCU4_CC4_INTE_PME_Msk          //disables all other cc service requests
#define DISABLE_DALI_TxCOMPARE_IRQ              DALI_TIM_Tx->INTE &= (~CCU4_CC4_INTE_PME_Msk)
#define DALI_TxCOMPARE_IRQ_ENABLED              ((DALI_TIM_Tx->INTE & CCU4_CC4_INTE_PME_Msk)!=0)    //ask for service request enabled
#if (DALI_CONFIG_COMP_SRQ == 0)
  #define SET_DALI_Tx_SERVICE          DALI_TIM_Tx->SRS = 0x0000UL              //select CC40SR0 for event0 (capture), CC40SR1 for period match (compare)
#elif (DALI_CONFIG_COMP_SRQ == 1)
  #define SET_DALI_Tx_SERVICE          DALI_TIM_Tx->SRS = 0x0001UL              //select CC40SR1 for event0 (capture), CC40SR1 for period match (compare)
#elif (DALI_CONFIG_COMP_SRQ == 2)
  #define SET_DALI_Tx_SERVICE          DALI_TIM_Tx->SRS = 0x0002UL              //select CC40SR2 for event0 (capture), CC40SR1 for period match (compare)
#elif (DALI_CONFIG_COMP_SRQ == 3)
  #define SET_DALI_Tx_SERVICE          DALI_TIM_Tx->SRS = 0x0003UL              //select CC40SR3 for event0 (capture), CC40SR1 for period match (compare)
#endif

//----   D A L I    Interrupt Requests   ---------------------------------------
//******************************************************************************



