Jiangchunjun/Project_NFC_1_10V/Application/src/modules/Dali/HW/DaliUart_XMC1xxx.h
//******************************************************************************
//----   D A L I    R x   ------------------------------------------------------
//
//----  general timer definitions  ---------------------------------------------
#if (DALI_CONFIG_Rx_TIMER == 0)
  #define DALI_TIM_Rx                         CCU40_CC40                          //pointer on timer specific config bytes
  #define ENABLE_DALI_TIMER_CLOCK_Rx          CCU40->GIDLC |= CCU4_GIDLC_CS0I_Msk   //clear idle mode starts clock
  #define DISABLE_DALI_TIMER_CLOCK_Rx         CCU40->GIDLS |= CCU4_GIDLS_SS0I_Msk   //set idle mode stops clock
  #define ENA_SHADOW_TRANS_Rx                 CCU40->GCSS |= CCU4_GCSS_S0SE_Msk

#elif (DALI_CONFIG_Rx_TIMER == 1)
  #define DALI_TIM_Rx                         CCU40_CC41                          //pointer on timer specific config bytes
  #define ENABLE_DALI_TIMER_CLOCK_Rx          CCU40->GIDLC |= CCU4_GIDLC_CS1I_Msk   //clear idle mode starts clock
  #define DISABLE_DALI_TIMER_CLOCK_Rx         CCU40->GIDLS |= CCU4_GIDLS_SS1I_Msk   //set idle mode stops clock
  #define ENA_SHADOW_TRANS_Rx                 CCU40->GCSS |= CCU4_GCSS_S1SE_Msk

#elif (DALI_CONFIG_Rx_TIMER == 2)
  #define DALI_TIM_Rx                         CCU40_CC42                          //pointer on timer specific config bytes
  #define ENABLE_DALI_TIMER_CLOCK_Rx          CCU40->GIDLC |= CCU4_GIDLC_CS2I_Msk   //clear idle mode starts clock
  #define DISABLE_DALI_TIMER_CLOCK_Rx         CCU40->GIDLS |= CCU4_GIDLS_SS2I_Msk   //set idle mode stops clock
  #define ENA_SHADOW_TRANS_Rx                 CCU40->GCSS |= CCU4_GCSS_S2SE_Msk

#elif (DALI_CONFIG_Rx_TIMER == 3)
  #define DALI_TIM_Rx                         CCU40_CC43                          //pointer on timer specific config bytes
  #define ENABLE_DALI_TIMER_CLOCK_Rx          CCU40->GIDLC |= CCU4_GIDLC_CS3I_Msk   //clear idle mode starts clock
  #define DISABLE_DALI_TIMER_CLOCK_Rx         CCU40->GIDLS |= CCU4_GIDLS_SS3I_Msk   //set idle mode stops clock
  #define ENA_SHADOW_TRANS_Rx                 CCU40->GCSS |= CCU4_GCSS_S3SE_Msk
#endif



//----  RX timer port definitions  ---------------------------------------------
#define DALI_GPIO_Rx                          PORT0


//----     Rx Timer0      ------------------------------------------------------
#if (DALI_CONFIG_Rx_TIMER == 0)
  #if defined(DALI_CONFIG_RxPIN_P0_12)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P12_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR12 &= ~PORT0_IOCR12_PC12_Msk; PORT0->PHCR1 |= 0x00040000UL;    //by default GPIO is set to input with no pull up or pull down
    #define SLCT_EVENT0_INPUT                                    //by default inputA = P0.12 is selected for event0

  #elif defined(DALI_CONFIG_RxPIN_P0_6)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P6_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR4 &= ~PORT0_IOCR4_PC6_Msk; PORT0->PHCR0 |= 0x04000000UL;
    #define SLCT_EVENT0_INPUT                 DALI_TIM_Rx->INS |= 0x01UL                   //select timer inputB = P0.6 for event0

  #elif defined(DALI_CONFIG_RxPIN_P0_0)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P0_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR0 &= ~PORT0_IOCR0_PC0_Msk; PORT0->PHCR0 |= 0x00000004UL;
    #define SLCT_EVENT0_INPUT                 DALI_TIM_Rx->INS |= 0x02UL                   //select timer inputC = P0.0 for event0
  #endif



//----     Rx Timer1      ------------------------------------------------------
#elif (DALI_CONFIG_Rx_TIMER == 1)
  #if defined(DALI_CONFIG_RxPIN_P0_12)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P12_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR12 &= ~PORT0_IOCR12_PC12_Msk; PORT0->PHCR1 |= 0x00040000UL;    //by default GPIO is set to input with no pull up or pull down
  #define SLCT_EVENT0_INPUT                                    //by default inputA = P0.12 is selected for event0

  #elif defined(DALI_CONFIG_RxPIN_P0_7)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P7_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR4 &= ~PORT0_IOCR4_PC7_Msk; PORT0->PHCR0 |= 0x40000000UL;
    #define SLCT_EVENT0_INPUT                 DALI_TIM_Rx->INS |= 0x01UL                //select timer inputB = P0.7 for event0

  #elif defined(DALI_CONFIG_RxPIN_P0_1)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P1_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR0 &= ~PORT0_IOCR0_PC1_Msk; PORT0->PHCR0 |= 0x00000040UL;
    #define SLCT_EVENT0_INPUT                 DALI_TIM_Rx->INS |= 0x02UL                //select timer inputC = P0.1 for event0
  #endif



//----     Rx Timer2      ------------------------------------------------------
#elif (DALI_CONFIG_Rx_TIMER == 2)
  #if defined(DALI_CONFIG_RxPIN_P0_12)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P12_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR12 &= ~PORT0_IOCR12_PC12_Msk; PORT0->PHCR1 |= 0x00040000UL;    //by default GPIO is set to input with no pull up or pull down
    #define SLCT_EVENT0_INPUT                                    //by default inputA = P0.12 is selected for event0

  #elif defined(DALI_CONFIG_RxPIN_P0_8)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P8_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR8 &= ~PORT0_IOCR8_PC8_Msk; PORT0->PHCR1 |= 0x00000004UL;
    #define SLCT_EVENT0_INPUT                 DALI_TIM_Rx->INS |= 0x01UL                  //select timer inputB = P0.8 for event0

  #elif defined(DALI_CONFIG_RxPIN_P0_2)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P2_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR0 &= ~PORT0_IOCR0_PC2_Msk; PORT0->PHCR0 |= 0x00000400UL;
    #define SLCT_EVENT0_INPUT                 DALI_TIM_Rx->INS |= 0x02UL                //select timer inputB = P0.2 for event0
  #endif



//----     Rx Timer3      ------------------------------------------------------
#elif (DALI_CONFIG_Rx_TIMER == 3)
  #if defined(DALI_CONFIG_RxPIN_P0_12)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P12_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR12 &= ~PORT0_IOCR12_PC12_Msk; PORT0->PHCR1 |= 0x00040000UL;    //by default GPIO is set to input with no pull up or pull down
    #define SLCT_EVENT0_INPUT

  #elif defined(DALI_CONFIG_RxPIN_P0_9)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P9_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR8 &= ~PORT0_IOCR8_PC9_Msk; PORT0->PHCR1 |= 0x00000040UL;
    #define SLCT_EVENT0_INPUT                 DALI_TIM_Rx->INS |= 0x01UL                  //select timer inputB = P0.9 for event0

