Jiangchunjun/Project_NFC_1_10V/Application/src/modules/Dali/HW/DaliUart_XMC1xxx.h
  #elif defined(DALI_CONFIG_RxPIN_P0_3)
    #define DALI_GPIO_Rx_PIN                  PORT0_IN_P3_Msk
    #define SET_IN_OUT_DEFLT_CONF             DALI_GPIO_Rx->IOCR0 &= ~PORT0_IOCR0_PC3_Msk; PORT0->PHCR0 |= 0x00004000UL;
    #define SLCT_EVENT0_INPUT                 DALI_TIM_Rx->INS |= 0x02UL                  //select timer inputB = P0.3 for event0
  #endif
#endif



//----  MACRO definitions to handle Rx -----------------------------------------
#define SLCT_EVENT0_DEFLT_INPUT          DALI_TIM_Rx->INS &= ~CCU4_CC4_INS_EV0IS_Msk      //by default inputA = P0.12 is selected for event0
#define DALI_GPIO_Rx_INIT                     {SET_IN_OUT_DEFLT_CONF; \
                                              SLCT_EVENT0_DEFLT_INPUT; \
                                              SLCT_EVENT0_INPUT;}

//                                              SET_LARGE_INPUT_HYST; \


#define CLR_DALI_RxCPTR_EDGE_MODE        DALI_TIM_Rx->INS &= ~CCU4_CC4_INS_EV0EM_Msk
#define SET_DALI_RxCPTR_ON_POS_EDGE        DALI_TIM_Rx->INS |= 0x00010000UL
#define SET_DALI_RxCPTR_ON_NEG_EDGE        DALI_TIM_Rx->INS |= 0x00020000UL
#define TOGGLE_DALI_RxCAPTURE                 DALI_TIM_Rx->INS ^= CCU4_CC4_INS_EV0EM_Msk         //toggle edge sensitivity
#ifdef DALI_CONFIG_RX_INVERT
  #define IS_DALI_RxLEVEL_HIGH                ((DALI_GPIO_Rx->IN & DALI_GPIO_Rx_PIN) ==0)
//  #define GET_DALI_RxLEVEL                    ((~(DALI_GPIO_Rx->IN)) & DALI_GPIO_Rx_PIN)      //read digital input value
  #define START_DALI_RxCAPTURE_FALLING        {CLR_DALI_RxCPTR_EDGE_MODE; \
                                              SET_DALI_RxCPTR_ON_POS_EDGE;}                    //falling edge sensitive (because signal is inverted!)
  #define START_DALI_RxCAPTURE_RISING         {CLR_DALI_RxCPTR_EDGE_MODE; \
                                              SET_DALI_RxCPTR_ON_NEG_EDGE;}                    //rising edge sensitive
#else
  #define IS_DALI_RxLEVEL_HIGH                ((DALI_GPIO_Rx->IN & DALI_GPIO_Rx_PIN) !=0)
//  #define GET_DALI_RxLEVEL                    (DALI_GPIO_Rx->IN & DALI_GPIO_Rx_PIN)
  #define START_DALI_RxCAPTURE_FALLING        {CLR_DALI_RxCPTR_EDGE_MODE; \
                                              SET_DALI_RxCPTR_ON_NEG_EDGE;}
  #define START_DALI_RxCAPTURE_RISING         {CLR_DALI_RxCPTR_EDGE_MODE; \
                                              SET_DALI_RxCPTR_ON_POS_EDGE;}
#endif

#define CLR_DALI_Rx_TIMER            DALI_TIM_Rx->TCCLR = CCU4_CC4_TCCLR_TRBC_Msk
#define START_DALI_Rx_TIMER            DALI_TIM_Rx->TCSET |= CCU4_CC4_TCSET_TRBS_Msk
#define START_DALI_TIMER_Rx                   {ENA_SHADOW_TRANS_Rx; \
                        CLR_DALI_Rx_TIMER; \
                                              START_DALI_Rx_TIMER;}

#define CLR_EVENT0_INPUT_CONF          DALI_TIM_Rx->INS &= 0xF9BCFFFFUL
#define CONF_EVENT0_INPUT            DALI_TIM_Rx->INS |= 0x02010000UL    //3 cycles low pass filter and capture with pos edge
#define CONF_EVENT_FUNC              DALI_TIM_Rx->CMC = 0x00000010UL    //event0 is connected with capture0 function , compare mode and other external functions are disabled
#define INIT_DALI_RxCAPTURE                   {CLR_EVENT0_INPUT_CONF; \
                                              CONF_EVENT0_INPUT; \
                                              CONF_EVENT_FUNC;}

#define READ_DALI_RxTIMER                     (uint16_t)(DALI_TIM_Rx->TIMER)                // limited to uint16
#define DALI_RxCAPTURE_REG                    (DALI_TIM_Rx->CV[1])
#define READ_DALI_RxCAPTURE_REG               (uint16_t)(DALI_TIM_Rx->CV[1])

//----   D A L I    R x   ------------------------------------------------------
//******************************************************************************


//******************************************************************************
//----   D A L I    T x   ------------------------------------------------------
#if (DALI_CONFIG_Tx_TIMER == 0)
  #define DALI_TIM_Tx                         CCU40_CC40                          //pointer on timer specific config bytes
  #define ENABLE_DALI_TIMER_CLOCK_Tx          CCU40->GIDLC |= CCU4_GIDLC_CS0I_Msk   //clear idle mode starts clock
  #define DISABLE_DALI_TIMER_CLOCK_Tx         CCU40->GIDLS |= CCU4_GIDLS_SS0I_Msk   //set idle mode stops clock
  #define SET_TxTIMER_STATE                   CCU4_GCSS_S0STS_Msk
  #define CLR_TxTIMER_STATE                   CCU4_GCSC_S0STC_Msk
  #define ENABLE_SHADOW_TRANS_Tx              CCU40->GCSS |= CCU4_GCSS_S0SE_Msk

#elif (DALI_CONFIG_Tx_TIMER == 1)
  #define DALI_TIM_Tx                         CCU40_CC41                          //pointer on timer specific config bytes
  #define ENABLE_DALI_TIMER_CLOCK_Tx          CCU40->GIDLC |= CCU4_GIDLC_CS1I_Msk    //clear idle mode starts clock
  #define DISABLE_DALI_TIMER_CLOCK_Tx         CCU40->GIDLS |= CCU4_GIDLS_SS1I_Msk    //set idle mode stops clock
  #define SET_TxTIMER_STATE                   CCU4_GCSS_S1STS_Msk
  #define CLR_TxTIMER_STATE                   CCU4_GCSC_S1STC_Msk
  #define ENABLE_SHADOW_TRANS_Tx              CCU40->GCSS |= CCU4_GCSS_S1SE_Msk

#elif (DALI_CONFIG_Tx_TIMER == 2)
  #define DALI_TIM_Tx                         CCU40_CC42                          //pointer on timer specific config bytes
  #define ENABLE_DALI_TIMER_CLOCK_Tx          CCU40->GIDLC |= CCU4_GIDLC_CS2I_Msk    //clear idle mode starts clock
  #define DISABLE_DALI_TIMER_CLOCK_Tx         CCU40->GIDLS |= CCU4_GIDLS_SS2I_Msk    //set idle mode stops clock
  #define SET_TxTIMER_STATE                   CCU4_GCSS_S2STS_Msk
  #define CLR_TxTIMER_STATE                   CCU4_GCSC_S2STC_Msk
  #define ENABLE_SHADOW_TRANS_Tx              CCU40->GCSS |= CCU4_GCSS_S2SE_Msk

#elif (DALI_CONFIG_Tx_TIMER == 3)
  #define DALI_TIM_Tx                         CCU40_CC43                          //pointer on timer specific config bytes
  #define ENABLE_DALI_TIMER_CLOCK_Tx          CCU40->GIDLC |= CCU4_GIDLC_CS3I_Msk    //clear idle mode starts clock
  #define DISABLE_DALI_TIMER_CLOCK_Tx         CCU40->GIDLS |= CCU4_GIDLS_SS3I_Msk    //set idle mode stops clock
  #define SET_TxTIMER_STATE                   CCU4_GCSS_S3STS_Msk
  #define CLR_TxTIMER_STATE                   CCU4_GCSC_S3STC_Msk
  #define ENABLE_SHADOW_TRANS_Tx              CCU40->GCSS |= CCU4_GCSS_S3SE_Msk
#endif


