Jiangchunjun/Project_NFC_1_10V/Application/src/modules/Dali/HW/DaliUart_XMC1xxx.h
//----  timer port definitions  ------------------------------------------------
#if (DALI_CONFIG_Tx_TIMER != DALI_CONFIG_Rx_TIMER)
//----     Tx Timer0      ------------------------------------------------------
  #if (DALI_CONFIG_Tx_TIMER == 0)
    #if defined(DALI_CONFIG_TxPIN_P0_0)
      #define DALI_GPIO_Tx                    PORT0
      #define DALI_GPIO_Tx_PIN                PORT0_IN_P0_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR0 &= ~PORT0_IOCR0_PC0_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR0 &= ~PORT0_IOCR0_PC0_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR0 |= 0x000000A0UL           //select push/pull output driven by CCU40Out0

    #elif defined(DALI_CONFIG_TxPIN_P0_5)
      #define DALI_GPIO_Tx                    PORT0
      #define DALI_GPIO_Tx_PIN                PORT0_IN_P5_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR4 &= ~PORT0_IOCR4_PC5_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR4 &= ~PORT0_IOCR4_PC5_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR4 |= 0x0000A000UL           //select push/pull output driven by CCU40Out0

    #elif defined(DALI_CONFIG_TxPIN_P0_6)
      #define DALI_GPIO_Tx                    PORT0
      #define DALI_GPIO_Tx_PIN                PORT0_IN_P6_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR4 &= ~PORT0_IOCR4_PC6_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR4 &= ~PORT0_IOCR4_PC6_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR4 |= 0x00A00000UL           //select push/pull output driven by CCU40Out0

    #elif defined(DALI_CONFIG_TxPIN_P1_0)
      #define DALI_GPIO_Tx                    PORT1
      #define DALI_GPIO_Tx_PIN                PORT1_IN_P0_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR0 &= ~PORT1_IOCR0_PC0_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR0 &= ~PORT1_IOCR0_PC0_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR0 |= 0x00000090UL           //select push/pull output driven by CCU40Out0

    #elif defined(DALI_CONFIG_TxPIN_P2_0)
      #define DALI_GPIO_Tx                    PORT2
      #define DALI_GPIO_Tx_PIN                PORT2_IN_P0_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR0 &= ~PORT2_IOCR0_PC0_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR0 &= ~PORT2_IOCR0_PC0_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR0 |= 0x00000090UL           //select push/pull output driven by CCU40Out0
    #endif

//----     Tx Timer1      ------------------------------------------------------
  #elif (DALI_CONFIG_Tx_TIMER == 1)
    #if defined(DALI_CONFIG_TxPIN_P0_1)
      #define DALI_GPIO_Tx                    PORT0
      #define DALI_GPIO_Tx_PIN                PORT0_IN_P1_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR0 &= ~PORT0_IOCR0_PC1_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR0 &= ~PORT0_IOCR0_PC1_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR0 |= 0x0000A000UL           //select push/pull output driven by CCU40Out1

    #elif defined(DALI_CONFIG_TxPIN_P0_4)
      #define DALI_GPIO_Tx                    PORT0
      #define DALI_GPIO_Tx_PIN                PORT0_IN_P4_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR4 &= ~PORT0_IOCR4_PC4_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR4 &= ~PORT0_IOCR4_PC4_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR4 |= 0x000000A0UL           //select push/pull output driven by CCU40Out1

    #elif defined(DALI_CONFIG_TxPIN_P0_7)
      #define DALI_GPIO_Tx                    PORT0
      #define DALI_GPIO_Tx_PIN                PORT0_IN_P7_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR4 &= ~PORT0_IOCR4_PC7_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR4 &= ~PORT0_IOCR4_PC7_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR4 |= 0xA0000000UL           //select push/pull output driven by CCU40Out1

    #elif defined(DALI_CONFIG_TxPIN_P1_1)
      #define DALI_GPIO_Tx                    PORT1
      #define DALI_GPIO_Tx_PIN                PORT1_IN_P1_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR0 &= ~PORT1_IOCR0_PC1_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR0 &= ~PORT1_IOCR0_PC1_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR0 |= 0x00009000UL           //select push/pull output driven by CCU40Out1

    #elif defined(DALI_CONFIG_TxPIN_P2_1)
      #define DALI_GPIO_Tx                    PORT2
      #define DALI_GPIO_Tx_PIN                PORT2_IN_P1_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR0 &= ~PORT2_IOCR0_PC1_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR0 &= ~PORT2_IOCR0_PC1_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR0 |= 0x00009000UL           //select push/pull output driven by CCU40Out1
    #endif // DALI_CONFIG_TxCHANNEL

//----     Tx Timer2      ------------------------------------------------------
  #elif (DALI_CONFIG_Tx_TIMER == 2)
    #if defined(DALI_CONFIG_TxPIN_P0_2)
      #define DALI_GPIO_Tx                    PORT0
      #define DALI_GPIO_Tx_PIN                PORT0_IN_P2_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR0 &= ~PORT0_IOCR0_PC2_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR0 &= ~PORT0_IOCR0_PC2_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR0 |= 0x00A00000UL           //select push/pull output driven by CCU40Out2

    #elif (defined(DALI_CONFIG_TxPIN_P0_8) && !defined(DALI_CONFIG_RxPIN_P0_8))
      #define DALI_GPIO_Tx                    PORT0
      #define DALI_GPIO_Tx_PIN                PORT0_IN_P8_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR8 &= ~PORT0_IOCR8_PC8_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR8 &= ~PORT0_IOCR8_PC8_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR8 |= 0x000000A0UL           //select push/pull output driven by CCU40Out2

    #elif defined(DALI_CONFIG_TxPIN_P1_2)
      #define DALI_GPIO_Tx                    PORT1
      #define DALI_GPIO_Tx_PIN                PORT1_IN_P2_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR0 &= ~PORT1_IOCR0_PC2_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR0 &= ~PORT1_IOCR0_PC2_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR0 |= 0x00900000UL           //select push/pull output driven by CCU40Out2

    #elif defined(DALI_CONFIG_TxPIN_P2_10)
      #define DALI_GPIO_Tx                    PORT2
      #define DALI_GPIO_Tx_PIN                PORT2_IN_P10_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR8 &= ~PORT2_IOCR8_PC10_Msk  //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR8 &= ~PORT2_IOCR8_PC10_Msk  //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR8 |= 0x00900000UL           //select push/pull output driven by CCU40Out2
    #endif


//----     Tx Timer3      ------------------------------------------------------
  #elif (DALI_CONFIG_Tx_TIMER == 3)
    #if defined(DALI_CONFIG_TxPIN_P0_3)
      #define DALI_GPIO_Tx                    PORT0
      #define DALI_GPIO_Tx_PIN                PORT0_IN_P3_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR0 &= ~PORT0_IOCR0_PC3_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR0 &= ~PORT0_IOCR0_PC3_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR0 |= 0xA0000000UL           //select push/pull output driven by CCU40Out3

    #elif defined(DALI_CONFIG_TxPIN_P0_9)
      #define DALI_GPIO_Tx                    PORT0
      #define DALI_GPIO_Tx_PIN                PORT0_IN_P9_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR8 &= ~PORT0_IOCR8_PC9_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR8 &= ~PORT0_IOCR8_PC9_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR8 |= 0x0000A000UL           //select push/pull output driven by CCU40Out3

    #elif defined(DALI_CONFIG_TxPIN_P1_3)
      #define DALI_GPIO_Tx                    PORT1
      #define DALI_GPIO_Tx_PIN                PORT1_IN_P3_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR0 &= ~PORT1_IOCR0_PC3_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR0 &= ~PORT1_IOCR0_PC3_Msk   //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR0 |= 0x90000000UL           //select push/pull output driven by CCU40Out3

