Jiangchunjun/Project_NFC_1_10V/Application/src/modules/Dali/HW/DaliUart_XMC1xxx.h
    #elif defined(DALI_CONFIG_TxPIN_P2_11)
      #define DALI_GPIO_Tx                    PORT2
      #define DALI_GPIO_Tx_PIN                PORT2_IN_P11_Msk
      #define DALI_GPIO_Tx_INIT_IDLE          DALI_GPIO_Tx->IOCR8 &= ~PORT2_IOCR8_PC11_Msk  //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_IDLE           DALI_GPIO_Tx->IOCR8 &= ~PORT2_IOCR8_PC11_Msk  //select input with no pull up/down
      #define DALI_GPIO_Tx_SET_ACTIVE         DALI_GPIO_Tx->IOCR8 |= 0x90000000UL           //select push/pull output driven by CCU40Out3
    #endif
  #endif
#else
  Rx and Tx have to use different timers (unit: %)
#endif
//----  timer port definitions  ------------------------------------------------


//!!!!shadow registers PRS, PSL will be reloaded with every period overflow!!!!
#define CLR_DALI_Tx_TIMER            DALI_TIM_Tx->TCCLR = CCU4_CC4_TCCLR_TCC_Msk
#define START_DALI_Tx_TIMER            DALI_TIM_Tx->TCSET |= CCU4_CC4_TCSET_TRBS_Msk
#define START_DALI_TIMER_Tx                   { ENABLE_DALI_TIMER_CLOCK_Tx; \
                                                ENA_SHADOW_TRANS_Tx; \
                                                CLR_DALI_Tx_TIMER; \
                                                START_DALI_Tx_TIMER; }

#define STOP_DALI_Tx_TIMER            DALI_TIM_Tx->TCCLR |= (CCU4_CC4_TCCLR_TRBC_Msk | CCU4_CC4_TCCLR_TCC_Msk)
#define STOP_DALI_TIMER_Tx                    {STOP_DALI_Tx_TIMER; \
                        DISABLE_DALI_TIMER_CLOCK_Tx;}
#define IS_DALI_Tx_TIMER_RUNNING              ((DALI_TIM_Tx->TCST & CCU4_CC4_TCST_TRB_Msk) != 0)

#ifdef DALI_CONFIG_TX_INVERT
  #define ENABLE_DALI_TxCOMPARE               DALI_TIM_Tx->PSL = 0x00UL;        //passive level is low (DALI passive level=high)
#else
  #define ENABLE_DALI_TxCOMPARE               DALI_TIM_Tx->PSL = 0x01UL;        //passive level is high (DALI passive level=high)
#endif

#define DALI_TxTIMER_REG                      (DALI_TIM_Tx->TIMER)              //read current timer value
//#define DALI_TxCOMPARE_REG                    (DALI_TIM_Tx->PRS)

#define FORCE_ACTIVE_DALI_TxCOMPARE           CCU40->GCSS |= SET_TxTIMER_STATE  //set state to active
#define FORCE_IDLE_DALI_TxCOMPARE             CCU40->GCSC |= CLR_TxTIMER_STATE  //set state to passive
//#define DALI_QUERY_HL_TxCOMPARE               (DALI_TIM_Tx->PSL == 0)           //reads the current used passive level
//#define DALI_QUERY_LH_TxCOMPARE               (DALI_TIM_Tx->PSL != 0)           //reads the current used passive level


//----   D A L I    T x   ------------------------------------------------------
//******************************************************************************


// -----------------------------------------------------------------------------
// ------ G e n e r a l   S e t t i n g s   ------------------------------------


// --- Definitions for DALI-Timer   --------------------------------------------
#if (DALI_CONFIG_TIMER_CLK_MHz == 32)                                                    //define prescaler factor depending on system clock
  #if defined(configDOUBLE_PRHP_CLK)                                            //some peripherals could be clocked with double of system clock
    #define PRESCLR                           0x06UL
    #define PRPHL_CLK_SLCTN                   SCU_CLK_CLKCR_PCLKSEL_Msk
  #else
    #define PRESCLR                           0x05UL
    #define PRPHL_CLK_SLCTN                   0x00UL
  #endif
  #define MCLK_DIVIDER              0x0100UL              //IDIV = 1, FDIV = 0 => 32MHz
//  #define SYS_TICK_TIME             3199                //system tick all 100us
#elif (DALI_CONFIG_TIMER_CLK_MHz == 16)
  #if defined(configDOUBLE_PRHP_CLK)
    #define PRESCLR                           0x05UL
    #define PRPHL_CLK_SLCTN                   SCU_CLK_CLKCR_PCLKSEL_Msk
  #else
    #define PRESCLR                           0x04UL
    #define PRPHL_CLK_SLCTN                   0x00UL
  #endif
  #define MCLK_DIVIDER              0x0200UL              //IDIV = 2, FDIV = 0 => 16MHz
//  #define SYS_TICK_TIME             1599                 //system tick all 100us
#elif (DALI_CONFIG_TIMER_CLK_MHz == 8)
  #if defined(configDOUBLE_PRHP_CLK)
    #define PRESCLR                           0x04UL
    #define PRPHL_CLK_SLCTN                   SCU_CLK_CLKCR_PCLKSEL_Msk
  #else
    #define PRESCLR                           0x03UL
    #define PRPHL_CLK_SLCTN                   0x00UL
  #endif
  #define MCLK_DIVIDER              0x0400UL              //IDIV = 4, FDIV = 0 => 8MHz
//  #define SYS_TICK_TIME             799                 //system tick all 100us
#else
  DALI_CONFIG_TIMER_CLK_MHz must be defined as 32, 16 or 8 MHz (unit: %)
#endif


#define DISABLE_PSSWRD_PRTCTN          SCU_GENERAL->PASSWD = 0xC0UL
#define CLR_MCLCK_DIVIDER            SCU_CLK->CLKCR &= 0xFFFF0000
#define SET_MCLCK_DIVIDER            SCU_CLK->CLKCR |= MCLK_DIVIDER
#define CLR_PCLK_MCLK_RATIO            SCU_CLK->CLKCR &= ~SCU_CLK_CLKCR_PCLKSEL_Msk    //peripheral clock = system clock
#define SET_PCLK_MCLK_RATIO            SCU_CLK->CLKCR |= PRPHL_CLK_SLCTN          //peripheral clock = 2*system clock
#define ENA_CCU4_CLOCK              SCU_CLK->CGATCLR0 |= SCU_CLK_CGATCLR0_CCU40_Msk
//#define SET_SYS_TICK_TIME            PPB->SYST_RVR = SYS_TICK_TIME

#define START_CCU4_PRESCALER          CCU40->GIDLC |= CCU4_GIDLC_SPRB_Msk
#define CLR_CCU4_SUSPEND            CCU40->GCTRL &= ~CCU4_GCTRL_SUSCFG_Msk
#define SET_CCU4_SAFE_STOP            CCU40->GCTRL |= 0x00000200UL

#define SET_DALI_Rx_PRESCALER          DALI_TIM_Rx->PSC = PRESCLR
#define SET_DALI_Rx_MAX_PERIOD          DALI_TIM_Rx->PRS = CCU4_CC4_PRS_PRS_Msk      //set period to 0xFFFF
#define CONF_DALI_Rx_TIMER            DALI_TIM_Rx->TC = CCU4_CC4_TC_CLST_Msk|CCU4_CC4_TC_CCS_Msk  //ena shadow transfer on clear and ignore full flag status

#define SET_DALI_Tx_PRESCALER          DALI_TIM_Tx->PSC = PRESCLR
#define CLR_DALI_Tx_PERIOD            DALI_TIM_Tx->PRS = 0x00UL
#define CONF_DALI_Tx_TIMER            DALI_TIM_Tx->TC = CCU4_CC4_TC_CLST_Msk      //ena shadow transfer on clear

#define INIT_DALI_TIMER                       {DISABLE_PSSWRD_PRTCTN; \
                        CLR_MCLCK_DIVIDER; \
                        SET_MCLCK_DIVIDER; \
                        CLR_PCLK_MCLK_RATIO; \
                        SET_PCLK_MCLK_RATIO; \
                        ENA_CCU4_CLOCK; \
                        CLR_DALI_INTRPT_PENDING; \
                        ENABLE_DALI_INTRPT_NODE; \
                                              START_CCU4_PRESCALER; \
                                              CLR_CCU4_SUSPEND; \
                                              SET_CCU4_SAFE_STOP; \
                                              \
                                              SET_DALI_Rx_MAX_PERIOD; \
                                              SET_DALI_Rx_PRESCALER; \
                                              SET_DALI_Rx_SERVICE; \
                                              ENA_SHADOW_TRANS_Rx; \
                                              CONF_DALI_Rx_TIMER; \
                                              \
                                              CLR_DALI_Tx_PERIOD; \
                                              SET_DALI_Tx_PRESCALER; \
                                              SET_DALI_Tx_SERVICE; \
                                              CONF_DALI_Tx_TIMER;}

